# Типы переменных
# Создайте несколько переменных разных типов.
# Проверьте к какому типу относятся созданные переменные.

a = 1
b = 2.2
c = 'lalala'
d = []
print(type(a), type(b), type(c), type(d))              ## "*"для списков и словарей