# Нарисовать в консоли ёлку спросив
# у пользователя количество рядов.
# Пример результата:
# Сколько рядов у ёлки? 5
#     *
#    ***
#   *****
#  *******
# *********

x =int(input ("введите число : "))
for i in range(0, x) :
    print (' '*(x-i)+'©'*(i) +'©'*(i+1))

###########################  2 вариант  #########################
# def spruce(row, i = 1):
#     if row > 0:
#         print(' ' * (row - 1) + '*' * (i * 2 - 1))
#         spruce(row - 1, i + 1)
#
# def Main():
#     row = int(input('Введите количество рядов - '))
#     spruce(row)
#
# Main()